doc/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-17 Mon 08:48 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Feast</title>
<meta name="author" content="Tim Vaughan" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="theme.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Feast</h1>
<p class="subtitle" role="doc-subtitle">Tasty additions to BEAST 2</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#id-1-Overview">1. Overview</a>
<ul>
<li><a href="#id-2-Installation">1.1. Installation</a></li>
<li><a href="#id-2-Building-from-source">1.2. Building from source</a></li>
</ul>
</li>
<li><a href="#id-1-Features">2. Features</a>
<ul>
<li><a href="#id-2-Single-BEAST-2.7-Jar-files">2.1. Single BEAST 2.7 Jar files</a></li>
<li><a href="#id-2-Initializing-RealParameters">2.2. Initializing RealParameters</a>
<ul>
<li><a href="#id-3-Initialize-RealParameters-from-CSV/TSV-files">2.2.1. Initialize RealParameters from CSV/TSV files</a></li>
<li><a href="#id-3-Initialize-RealParameters-from-Functions">2.2.2. Initialize RealParameters from Functions</a></li>
<li><a href="#id-3-Initializing-RealParameters-using-formatted-times">2.2.3. Initializing RealParameters using formatted times</a></li>
<li><a href="#id-3-Randomly-sampling-initial-RealParameter-values">2.2.4. Randomly sampling initial RealParameter values</a></li>
</ul>
</li>
<li><a href="#id-2-Coalescent-population-functions">2.3. Coalescent population functions</a>
<ul>
<li><a href="#id-3-Time-shifted-coalescent-population-functions">2.3.1. Time-shifted coalescent population functions</a></li>
<li><a href="#id-3-Compound-coalescent-population-functions">2.3.2. Compound coalescent population functions</a></li>
</ul>
</li>
<li><a href="#id-2-Log-File-Post-processing">2.4. Log File Post-processing</a></li>
<li><a href="#id-2-Model-selection">2.5. Model selection</a>
<ul>
<li><a href="#id-3-DirichletProcessOperator-and-DirichletProcessPrior">2.5.1. DirichletProcessOperator and DirichletProcessPrior</a></li>
<li><a href="#id-3-ModelSelectionParameter">2.5.2. ModelSelectionParameter</a></li>
</ul>
</li>
<li><a href="#id-2-Operators">2.6. Operators</a>
<ul>
<li><a href="#id-3-Scaling-subsets-of-RealParameter-elements-together">2.6.1. Scaling subsets of RealParameter elements together</a></li>
<li><a href="#id-3-Sampling-from-a-discrete-set-of-states">2.6.2. Sampling from a discrete set of states</a></li>
</ul>
</li>
<li><a href="#id-2-Model-validation">2.7. Model validation</a>
<ul>
<li><a href="#id-3-Easy-state-simulation">2.7.1. Easy state simulation</a></li>
<li><a href="#id-3-Sequence-alignment-simulation">2.7.2. Sequence alignment simulation</a></li>
<li><a href="#id-3-DensityMapper">2.7.3. DensityMapper</a></li>
</ul>
</li>
<li><a href="#id-2-Function-(array)-creation-and-manipulation">2.8. Function (array) creation and manipulation</a>
<ul>
<li><a href="#id-3-Numeric-sequences-as-Functions">2.8.1. Numeric sequences as Functions</a></li>
<li><a href="#id-3-Function-Slicing">2.8.2. Function Slicing</a></li>
<li><a href="#id-3-Function-reversing">2.8.3. Function reversing</a></li>
<li><a href="#id-3-Function-concatenation">2.8.4. Function concatenation</a></li>
<li><a href="#id-3-Function-scaling">2.8.5. Function scaling</a></li>
<li><a href="#id-3-Function-interleaving">2.8.6. Function interleaving</a></li>
</ul>
</li>
<li><a href="#id-2-Tree-and-Alignment-Input/Output">2.9. Tree and Alignment Input/Output</a>
<ul>
<li><a href="#id-3-TreeFromNewickFile-&-TreeFromNexusFile">2.9.1. TreeFromNewickFile &amp; TreeFromNexusFile</a></li>
<li><a href="#id-3-TraitSetFromTaxonSet">2.9.2. TraitSetFromTaxonSet</a></li>
<li><a href="#id-3-TraitSetFromXSV">2.9.3. TraitSetFromXSV</a></li>
<li><a href="#id-3-TaxonSetFromTree">2.9.4. TaxonSetFromTree</a></li>
<li><a href="#id-3-AlignmentFromNexus/Fasta">2.9.5. AlignmentFromNexus/Fasta</a></li>
</ul>
</li>
<li><a href="#id-2-Mathematical-Expressions">2.10. Mathematical Expressions</a>
<ul>
<li><a href="#id-3-ExpCalculator">2.10.1. ExpCalculator</a></li>
<li><a href="#id-3-ExpCalculatorDistribution">2.10.2. ExpCalculatorDistribution</a></li>
<li><a href="#id-3-ExpCalculatorParametricDistribution">2.10.3. ExpCalculatorParametricDistribution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#id-1-License">3. License</a></li>
</ul>
</div>
</nav>
<p>
GitHub Repository: <a href="https://github.com/tgvaughan/feast">https://github.com/tgvaughan/feast</a>
</p>

<div id="outline-container-id-1-Overview" class="outline-2">
<h2 id="id-1-Overview"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-id-1-Overview">
<p>
This is a small BEAST 2 (<a href="http://www.beast2.org">http://www.beast2.org</a>) package which
contains additions to the core functionality.  The common thread
which connects these additions is that they all work to increase
the flexibility of BEAST and to empower users to set up a broader
range of analyses without needing to write additional Java code.
</p>

<p>
You won't find new models here, but you will find different
ways to combine existing models and make certain tasks easier.
</p>
</div>

<div id="outline-container-id-2-Installation" class="outline-3">
<h3 id="id-2-Installation"><span class="section-number-3">1.1.</span> Installation</h3>
<div class="outline-text-3" id="text-id-2-Installation">
<p>
You can install directly from within BEAUti by opening the package
manager via File-&gt;"Manage packages", selecting "feast" and clicking
the "Install/Upgrade" button.
</p>
</div>
</div>

<div id="outline-container-id-2-Building-from-source" class="outline-3">
<h3 id="id-2-Building-from-source"><span class="section-number-3">1.2.</span> Building from source</h3>
<div class="outline-text-3" id="text-id-2-Building-from-source">
<p>
To build the package you'll need OpenJDK 17 or later, the OpenJFX SDK
(<a href="https://openjfx.io">https://openjfx.io</a>) and Apache ANT (<a href="http://ant.apache.org">http://ant.apache.org</a>). Once
these dependencies are in place, issue the following command from the
root directory of this repository:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">JAVA_FX_HOME</span>=/path/to/openjfx/libs ant
</pre>
</div>

<p>
(Replace <code>/path/t/openjfx/libs</code> with the location of the OpenJFX libraries.)
The package archive will be left in the <code>dist/</code> directory.
</p>
</div>
</div>
</div>

<div id="outline-container-id-1-Features" class="outline-2">
<h2 id="id-1-Features"><span class="section-number-2">2.</span> Features</h2>
<div class="outline-text-2" id="text-id-1-Features">
<p>
The rest of this document is an asymptotically complete list of the features feast
provides, in reverse chronological order of the date each was added.
</p>
</div>

<div id="outline-container-id-2-Single-BEAST-2.7-Jar-files" class="outline-3">
<h3 id="id-2-Single-BEAST-2.7-Jar-files"><span class="section-number-3">2.1.</span> Single BEAST 2.7 Jar files</h3>
<div class="outline-text-3" id="text-id-2-Single-BEAST-2.7-Jar-files">
<p>
Unlike earlier versions, BEAST 2.7 has a sophisticated system for
controlling which package classes are available to use in analyses.
While this is a great step forward, its implementation currently
precludes building the stand-alone jar file bundles of BEAST 2 and its
packages which are so helpful for collaboration using in-development
BEAST 2 models.
</p>

<p>
Feast now includes a class <code>feast.app.FeastMain</code> which addresses this
problem.  It is a small wrapper around <code>beastfx.app.beast.BeastMain</code>
which, before handing control of the execution over to BEAST, seaches
through all of the directories and jar files in the runtime classpath
for files named <code>beast_services.xml</code>.  When it finds one of these files,
<code>FeastMain</code> treats these the same as a standard <code>version.xml</code> file by
registering all of the services it contains.
</p>

<p>
In order to use this wrapper to make a standalone jar file for a package,
follow these steps:
</p>

<ol class="org-ol">
<li>Copy (or symlink) any necessary version.xml files into the <code>src/</code>
directory of your project. You can place them in any package
directory you like, but be sure to name each file <code>beast_services.xml</code>.</li>
<li>Build a jar file with the <code>Main-Class:</code> attribute in <code>MANIFEST.MF</code>
set to <code>feast.app.FeastMain</code>.  (You don't necessarily need to edit
this file directly, most software that builds jar files will ask
you at some point for the main class: simply enter <code>feast.app.FeastMain</code>
when asked.)</li>
</ol>

<p>
To launch an analysis using this jar file (here we suppose it's named
<code>my.jar</code>), use either
</p>
<div class="org-src-container">
<pre class="src src-sh">java -jar my.jar analysis.xml
</pre>
</div>
<p>
or, if you are not using a combined openjdk+openjfx installation, 
</p>
<div class="org-src-container">
<pre class="src src-sh">java --module-path=/path/to/openjfx/libs --add-modules javafx.fxml -jar my.jar analysis.xml
</pre>
</div>
<p>
here <code>/path/to/openjfx/libs</code> specifies the location of the JavaFX libraries.
</p>
</div>
</div>
