doc/manual.org
*** Initialize RealParameters from CSV/TSV files
:PROPERTIES:
:CUSTOM_ID: id-3-Initialize-RealParameters-from-CSV/TSV-files
:END:

When setting up complicated analyses, it can be useful to extract some
(fixed) parameter values from an external CSV or TSV (or whatever-SV) file.
The ~RealParameterFromXSV~ and ~RealParameterFromLabelledXSV~ classes can be
used to do this.

~RealParameterFromXSV~ simply initializes the parameter with values read
(in row-major order) from a rectangular portion of the table in the specified
file. For instance,
#+begin_src xml
<migrationRates spec="feast.fileio.RealParameterFromXSV"
                fileName="migration_rates.csv"
                sep=","
                startRow="1" rowCount="3"
                startCol="1" colCount="3"/>
#+end_src
could be used to initialize a 3x3 matrix of migration rates in some analysis
using elements in a CSV file.  The inputs ~startRow~ and ~startCol~ both
default to "0", while leaving either ~rowCount~ and ~colCount~ undefined
will cause values to be taken up until the end of the corresponding row
or column.

~RealParameterFromLabelledXSV~ works simillarly, but assumes that the either
or both of the first row or column contain labels, and allows these labels
to be used to specify elements. For example,
#+begin_src xml
<samplingProportions spec="feast.fileio.RealParameterFromLabelledXSV"
    fileName="sampling.tsv"
    colLabels="sampling"
    rowLabels="early_cretaceous, late_cretaceous, jurassic"/>
#+end_src
could be used to set sampling rates for geological epochs from some
external data file.  If ~rowLabels~ is omitted, the entire column
will be read.  Similarly, if ~colLabels~ is omitted, the entire row
is read.
*** Initialize RealParameters from Functions
:PROPERTIES:
:CUSTOM_ID: id-3-Initialize-RealParameters-from-Functions
:END:

The ~RealParameterFromFunction~ class provides a ~RealParameter~ which is
**initialized** from a ~Function~.  Thus you can do things like

#+begin_src xml
<samplingRateChangeTimes spec="RealParameterFromFunction">
    <function spec="ExpCalculator" value="{0,max(taxonTimes)+0.1}">
        <arg id="taxonTimes" spec="TraitSetAsFunction" traitSet="@dateTrait"/>
    </function>
</samplingRateChangeTimes>
#+end_src

which initializes a BDSKY sampling rate change time array so that the change
automatically falls just before the oldest sample.

Beware that ~RealParameterFromFunction~ only retrieves the ~Function~ values
during initialization. **Changes in the ~Function~ values after initialization
will not be reflected in the parameter!**
*** Initializing RealParameters using formatted times
:PROPERTIES:
:CUSTOM_ID: id-3-Initializing-RealParameters-using-formatted-times
:END:

Particularly in birth-death models, it is often desirable to specify
several points in time as ages relative to the "present".  This is done
when setting up change times for birth-death parameters, and requires
one to do a fairly large number of error-prone calculations involving
converting date strings like "05/03/1980" and "27/02/1980" to fractional
years before some later date such as "01/01/1990".  Once converted, these
values become extremely important yet difficult to interpret entries in
the final BEAST XML file.

The ~TimeParameter~ class is intended to combat this.  It can be used
anywhere that a ~RealParameter~ is expected.  For example, to create
a ~RealParameter~ with the ages corresponding to the times above, use

#+begin_src xml
<parameter spec="TimeParameter"
           time="05/03/1980 27/02/1980"
           mostRecentSampleTime="01/01/1990"
           timeFormat="dd/MM/yyyy"/>
#+end_src

This is completely equivalent to

#+begin_src xml
<parameter spec="RealParameter"
           value="9.825137 9.844262"/>
#+end_src

but much more readable.

Note that the time format specification string is the same as used by the
~dateFormat~ input to ~TraitSet~, and applies both to the values of ~time~
and the value of ~mostRecentSampleTime~.  If this format specifier is not provided,
the time is assumed to have already been converted to fractional years, so
the only action taken by TimeParameter is to subtract this value from
~mostRecentSampleTime~.
