doc/index.html

<div id="outline-container-id-2-Initializing-RealParameters" class="outline-3">
<h3 id="id-2-Initializing-RealParameters"><span class="section-number-3">2.2.</span> Initializing RealParameters</h3>
<div class="outline-text-3" id="text-id-2-Initializing-RealParameters">
</div>
<div id="outline-container-id-3-Initialize-RealParameters-from-CSV/TSV-files" class="outline-4">
<h4 id="id-3-Initialize-RealParameters-from-CSV/TSV-files"><span class="section-number-4">2.2.1.</span> Initialize RealParameters from CSV/TSV files</h4>
<div class="outline-text-4" id="text-id-3-Initialize-RealParameters-from-CSV/TSV-files">
<p>
When setting up complicated analyses, it can be useful to extract some
(fixed) parameter values from an external CSV or TSV (or whatever-SV) file.
The <code>RealParameterFromXSV</code> and <code>RealParameterFromLabelledXSV</code> classes can be
used to do this.
</p>

<p>
<code>RealParameterFromXSV</code> simply initializes the parameter with values read
(in row-major order) from a rectangular portion of the table in the specified
file. For instance,
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">migrationRates</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.RealParameterFromXSV"</span>
                <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"migration_rates.csv"</span>
                <span class="org-nxml-attribute-local-name">sep</span>=<span class="org-string">","</span>
                <span class="org-nxml-attribute-local-name">startRow</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">rowCount</span>=<span class="org-string">"3"</span>
                <span class="org-nxml-attribute-local-name">startCol</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">colCount</span>=<span class="org-string">"3"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
could be used to initialize a 3x3 matrix of migration rates in some analysis
using elements in a CSV file.  The inputs <code>startRow</code> and <code>startCol</code> both
default to "0", while leaving either <code>rowCount</code> and <code>colCount</code> undefined
will cause values to be taken up until the end of the corresponding row
or column.
</p>

<p>
<code>RealParameterFromLabelledXSV</code> works simillarly, but assumes that the either
or both of the first row or column contain labels, and allows these labels
to be used to specify elements. For example,
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">samplingProportions</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.RealParameterFromLabelledXSV"</span>
    <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"sampling.tsv"</span>
    <span class="org-nxml-attribute-local-name">colLabels</span>=<span class="org-string">"sampling"</span>
    <span class="org-nxml-attribute-local-name">rowLabels</span>=<span class="org-string">"early_cretaceous, late_cretaceous, jurassic"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
could be used to set sampling rates for geological epochs from some
external data file.  If <code>rowLabels</code> is omitted, the entire column
will be read.  Similarly, if <code>colLabels</code> is omitted, the entire row
is read.
</p>
</div>
</div>
<div id="outline-container-id-3-Initialize-RealParameters-from-Functions" class="outline-4">
<h4 id="id-3-Initialize-RealParameters-from-Functions"><span class="section-number-4">2.2.2.</span> Initialize RealParameters from Functions</h4>
<div class="outline-text-4" id="text-id-3-Initialize-RealParameters-from-Functions">
<p>
The <code>RealParameterFromFunction</code> class provides a <code>RealParameter</code> which is
<b><b>initialized</b></b> from a <code>Function</code>.  Thus you can do things like
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">samplingRateChangeTimes</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameterFromFunction"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">function</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ExpCalculator"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"{0,max(taxonTimes)+0.1}"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"taxonTimes"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TraitSetAsFunction"</span> <span class="org-nxml-attribute-local-name">traitSet</span>=<span class="org-string">"@dateTrait"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">function</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">samplingRateChangeTimes</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
which initializes a BDSKY sampling rate change time array so that the change
automatically falls just before the oldest sample.
</p>

<p>
Beware that <code>RealParameterFromFunction</code> only retrieves the <code>Function</code> values
during initialization. <b><b>Changes in the <code>Function</code> values after initialization
will not be reflected in the parameter!</b></b>
</p>
</div>
</div>
<div id="outline-container-id-3-Initializing-RealParameters-using-formatted-times" class="outline-4">
<h4 id="id-3-Initializing-RealParameters-using-formatted-times"><span class="section-number-4">2.2.3.</span> Initializing RealParameters using formatted times</h4>
<div class="outline-text-4" id="text-id-3-Initializing-RealParameters-using-formatted-times">
<p>
Particularly in birth-death models, it is often desirable to specify
several points in time as ages relative to the "present".  This is done
when setting up change times for birth-death parameters, and requires
one to do a fairly large number of error-prone calculations involving
converting date strings like "05/03/1980" and "27/02/1980" to fractional
years before some later date such as "01/01/1990".  Once converted, these
values become extremely important yet difficult to interpret entries in
the final BEAST XML file.
</p>

<p>
The <code>TimeParameter</code> class is intended to combat this.  It can be used
anywhere that a <code>RealParameter</code> is expected.  For example, to create
a <code>RealParameter</code> with the ages corresponding to the times above, use
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">parameter</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TimeParameter"</span>
           <span class="org-nxml-attribute-local-name">time</span>=<span class="org-string">"05/03/1980 27/02/1980"</span>
           <span class="org-nxml-attribute-local-name">mostRecentSampleTime</span>=<span class="org-string">"01/01/1990"</span>
           <span class="org-nxml-attribute-local-name">timeFormat</span>=<span class="org-string">"dd/MM/yyyy"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
This is completely equivalent to
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">parameter</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span>
           <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"9.825137 9.844262"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
but much more readable.
</p>

<p>
Note that the time format specification string is the same as used by the
<code>dateFormat</code> input to <code>TraitSet</code>, and applies both to the values of <code>time</code>
and the value of <code>mostRecentSampleTime</code>.  If this format specifier is not provided,
the time is assumed to have already been converted to fractional years, so
the only action taken by TimeParameter is to subtract this value from
<code>mostRecentSampleTime</code>.
</p>
</div>
</div>
