doc/manual.org
*** Randomly sampling initial RealParameter values
:PROPERTIES:
:CUSTOM_ID: id-3-Randomly-sampling-initial-RealParameter-values
:END:

Sometimes several attempts are needed to find a acceptable starting state for
MCMC. An initializer for tree, capable of generating a new starting tree at each
attempt is implemented in BEAST. ~InitRandomRealParameter~ allows you to sample new
initial parameter values at each attempt. The distribution, from which to sample, can
be the parameter prior or any other proper distribution.

For example, here we sample a birth rate value from a uniform distribution
at each initialization attempt:
#+begin_src xml
<init id="birthRateInitializer" spec="feast.parameter.InitRandomRealParameter"
    initial="@birthRate">
    <Uniform id="Uniform.birthRate" name="distr" lower="0" upper="1.5"/>
</init>
#+end_src


** Coalescent population functions
:PROPERTIES:
:CUSTOM_ID: id-2-Coalescent-population-functions
:END:
*** Time-shifted coalescent population functions
:PROPERTIES:
:CUSTOM_ID: id-3-Time-shifted-coalescent-population-functions
:END:

The ~ShiftedPopulationModel~ class allows you to create a new
~PopulationFunction~ which is a time-shifted view of an existing population
function.

For example, here is a time-shifted exponential growth population mode:
#+begin_src xml
<populationModel spec="ShiftedPopulationModel" offset="0.5">
    <populationModel spec="ExponentialGrowth" popSize="1.0" growthRate="1.0"/>
</populationModel>
#+end_src
At time 0, the population size of this shifted model is the same as
the population size of the exponential growth model at time 0.5.

The ~offset~ input expects a ~Function~ value, so ~RealParameter~ objectss etc. can
also be used here.
*** Compound coalescent population functions
:PROPERTIES:
:CUSTOM_ID: id-3-Compound-coalescent-population-functions
:END:

BEAST 2 includes several commonly-used coalescent population models such
as a constant population function and an exponential growth function.
To add other population functions required writing a new Java class.
The ~CompoundPopulationModel~ class lifts this restriction.

This class allows you to combine existing population functions (i.e.
objects which implement the ~PopulationFunction~ interface) in a piecewise
manner to construct arbitrarily complicated compound models.

For example, here is a piecewise-constant population function created
by joining together three ~ConstantPopulation~ models:
#+begin_src xml
<populationModel spec="CompoundPopulationModel">
    <populationModel spec="ConstantPopulation"> <popSize spec="RealParameter" value="5.0"/></populationModel>
    <populationModel spec="ConstantPopulation"> <popSize spec="RealParameter" value="10.0"/></populationModel>
    <populationModel spec="ConstantPopulation"> <popSize spec="RealParameter" value="2.0"/></populationModel>
    <changeTimes spec="RealParameter" value="1.0 3.0"/>
</populationModel>
#+end_src
The ~changeTimes~ input specifies the times of the transitions between
models, and thus must have one less element than the number of constituent models.

Setting the boolean ~makeContinuous~ input to "true" (by default it is "false")
will cause all component populations besides the most recent (i.e. first) to be
scaled so that the resulting compound population function is continuous.
While this is useless for compound population functions composed solely of
constant components (as it will result in a single constant population function),
this is useful for creating piecewise-exponential functions or mixtures between
exponential and constant components.

The file ~piecewiseCoalescent.xml~ illustrates how this class can be used in a
simple coalescent analysis.

