doc/index.html
<div id="outline-container-id-3-Randomly-sampling-initial-RealParameter-values" class="outline-4">
<h4 id="id-3-Randomly-sampling-initial-RealParameter-values"><span class="section-number-4">2.2.4.</span> Randomly sampling initial RealParameter values</h4>
<div class="outline-text-4" id="text-id-3-Randomly-sampling-initial-RealParameter-values">
<p>
Sometimes several attempts are needed to find a acceptable starting state for
MCMC. An initializer for tree, capable of generating a new starting tree at each
attempt is implemented in BEAST. <code>InitRandomRealParameter</code> allows you to sample new
initial parameter values at each attempt. The distribution, from which to sample, can
be the parameter prior or any other proper distribution.
</p>

<p>
For example, here we sample a birth rate value from a uniform distribution
at each initialization attempt:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">init</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"birthRateInitializer"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.parameter.InitRandomRealParameter"</span>
    <span class="org-nxml-attribute-local-name">initial</span>=<span class="org-string">"@birthRate"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Uniform</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"Uniform.birthRate"</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-string">"distr"</span> <span class="org-nxml-attribute-local-name">lower</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">upper</span>=<span class="org-string">"1.5"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">init</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-id-2-Coalescent-population-functions" class="outline-3">
<h3 id="id-2-Coalescent-population-functions"><span class="section-number-3">2.3.</span> Coalescent population functions</h3>
<div class="outline-text-3" id="text-id-2-Coalescent-population-functions">
</div>
<div id="outline-container-id-3-Time-shifted-coalescent-population-functions" class="outline-4">
<h4 id="id-3-Time-shifted-coalescent-population-functions"><span class="section-number-4">2.3.1.</span> Time-shifted coalescent population functions</h4>
<div class="outline-text-4" id="text-id-3-Time-shifted-coalescent-population-functions">
<p>
The <code>ShiftedPopulationModel</code> class allows you to create a new
<code>PopulationFunction</code> which is a time-shifted view of an existing population
function.
</p>

<p>
For example, here is a time-shifted exponential growth population mode:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ShiftedPopulationModel"</span> <span class="org-nxml-attribute-local-name">offset</span>=<span class="org-string">"0.5"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ExponentialGrowth"</span> <span class="org-nxml-attribute-local-name">popSize</span>=<span class="org-string">"1.0"</span> <span class="org-nxml-attribute-local-name">growthRate</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">populationModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
At time 0, the population size of this shifted model is the same as
the population size of the exponential growth model at time 0.5.
</p>

<p>
The <code>offset</code> input expects a <code>Function</code> value, so ~RealParameter~s etc. can
also be used here.
</p>
</div>
</div>
<div id="outline-container-id-3-Compound-coalescent-population-functions" class="outline-4">
<h4 id="id-3-Compound-coalescent-population-functions"><span class="section-number-4">2.3.2.</span> Compound coalescent population functions</h4>
<div class="outline-text-4" id="text-id-3-Compound-coalescent-population-functions">
<p>
BEAST 2 includes several commonly-used coalescent population models such
as a constant population function and an exponential growth function.
To add other population functions required writing a new Java class.
The <code>CompoundPopulationModel</code> class lifts this restriction.
</p>

<p>
This class allows you to combine existing population functions (i.e.
objects which implement the <code>PopulationFunction</code> interface) in a piecewise
manner to construct arbitrarily complicated compound models.
</p>

<p>
For example, here is a piecewise-constant population function created
by joining together three <code>ConstantPopulation</code> models:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"CompoundPopulationModel"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ConstantPopulation"</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">popSize</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"5.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">populationModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ConstantPopulation"</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">popSize</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"10.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">populationModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">populationModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ConstantPopulation"</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">popSize</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"2.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">populationModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">changeTimes</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.0 3.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">populationModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
The <code>changeTimes</code> input specifies the times of the transitions between
models, and thus must have one less element than the number of constituent models.
</p>

<p>
Setting the boolean <code>makeContinuous</code> input to "true" (by default it is "false")
will cause all component populations besides the most recent (i.e. first) to be
scaled so that the resulting compound population function is continuous.
While this is useless for compound population functions composed solely of
constant components (as it will result in a single constant population function),
this is useful for creating piecewise-exponential functions or mixtures between
exponential and constant components.
</p>

<p>
The file <code>piecewiseCoalescent.xml</code> illustrates how this class can be used in a
simple coalescent analysis.
</p>
</div>
</div>
</div>
