doc/index.html

<div id="outline-container-id-2-Log-File-Post-processing" class="outline-3">
<h3 id="id-2-Log-File-Post-processing"><span class="section-number-3">2.4.</span> Log File Post-processing</h3>
<div class="outline-text-3" id="text-id-2-Log-File-Post-processing">
<p>
Occasionally it's useful to be able to resurrect BEAST states from trace
and tree log files in order to perform further processing.  This is useful,
for instance, if you realise that it would have been useful to compute
additional tree statistics.  Or perhaps you'd like to stochastically map
ancestral traits onto trees belonging to the posterior of a multi-type
birth-death analysis.  The <code>feast.fileio.LogFileIterator</code> class and its
friends allow you to do these things and more.
</p>

<p>
The <code>LogFileIterator</code> class is a <code>Runnable</code> class, meaning that you use it
in place of BEAST's usual <code>MCMC</code> class at the top level.  A trivial example
is as follows:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">beast</span> <span class="org-nxml-attribute-local-name">version</span>=<span class="org-string">'2.0'</span> <span class="org-nxml-attribute-local-name">namespace</span>=<span class="org-string">'feast.fileio.logfileiterator:beast.evolution.tree:beast.core.parameter'</span><span class="org-nxml-tag-delimiter">&gt;</span>

  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">run</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"LogFileIterator"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logFileState</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TraceLogFileState"</span> <span class="org-nxml-attribute-local-name">logFileName</span>=<span class="org-string">"original_analysis.log"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logFileEntry</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"LogFileRealParameter"</span> <span class="org-nxml-attribute-local-name">fieldName</span>=<span class="org-string">"hky.kappa"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">fieldParameter</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"kappa"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"0.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logFileEntry</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logFileState</span><span class="org-nxml-tag-delimiter">&gt;</span>

    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logFileState</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TreeLogFileState"</span> <span class="org-nxml-attribute-local-name">logFileName</span>=<span class="org-string">"original_analysis.trees"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">tree</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"beast.evolution.tree.Tree"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"tree"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logFileState</span><span class="org-nxml-tag-delimiter">&gt;</span>

    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logger</span> <span class="org-nxml-attribute-local-name">logEvery</span>=<span class="org-string">"10000"</span> <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"processed.log"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"recoveredParameter"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"treestat"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"beast.evolution.tree.TreeStatLogger"</span> <span class="org-nxml-attribute-local-name">tree</span>=<span class="org-string">"@tree"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logger</span><span class="org-nxml-tag-delimiter">&gt;</span>

    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logger</span> <span class="org-nxml-attribute-local-name">logEvery</span>=<span class="org-string">"100000"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"kappa"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"treestat"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logger</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">run</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">beast</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
In this example (which is also provided in the examples directory as <code>TreeLogFileIteratorTest.xml</code>)
we use the "hky.kappa" field of the <code>original_analysis.log</code> trace log file to set the value of a
<code>RealParameter</code> named "kappa".  Simultaneously, we use the trees in the tree log file <code>original_analysis.trees</code>
to set the value of the <code>Tree</code> named "tree".  The value of "kappa" and the height and length statistics
of "tree" are then written to the file "processed.log" and the screen in the usual way using loggers.
</p>
</div>
</div>

<div id="outline-container-id-2-Model-selection" class="outline-3">
<h3 id="id-2-Model-selection"><span class="section-number-3">2.5.</span> Model selection</h3>
<div class="outline-text-3" id="text-id-2-Model-selection">
</div>
<div id="outline-container-id-3-DirichletProcessOperator-and-DirichletProcessPrior" class="outline-4">
<h4 id="id-3-DirichletProcessOperator-and-DirichletProcessPrior"><span class="section-number-4">2.5.1.</span> DirichletProcessOperator and DirichletProcessPrior</h4>
<div class="outline-text-4" id="text-id-3-DirichletProcessOperator-and-DirichletProcessPrior">
<p>
The <code>DirichletProcessPrior</code> and <code>DirichletProcessOperator</code> allow the application
of Dirichlet Process Priors (DPPs) to the elements of ~Function~s.
</p>

<p>
For example, suppose you have a model with parameter <code>X</code> to which you wish
to apply such a prior.  To do this, include the following prior for <code>X</code>
in the target density:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">distribution</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"DirichletProcessPrior"</span> <span class="org-nxml-attribute-local-name">parameter</span>=<span class="org-string">"@X"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">scaleParameter</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"dppScale"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">baseDistrib</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"dppBase"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"LogNormalDistributionModel"</span> <span class="org-nxml-attribute-local-name">M</span>=<span class="org-string">"0.8"</span> <span class="org-nxml-attribute-local-name">S</span>=<span class="org-string">"0.5"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">distribution</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
You also need to include the following operator:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">operator</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"DirichletProcessOperator"</span> <span class="org-nxml-attribute-local-name">parameter</span>=<span class="org-string">"@X"</span>
          <span class="org-nxml-attribute-local-name">scaleParameter</span>=<span class="org-string">"@dppScale"</span> <span class="org-nxml-attribute-local-name">baseDistrib</span>=<span class="org-string">"@dppBase"</span> <span class="org-nxml-attribute-local-name">weight</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Other operators on <code>X</code> can be included, but only if they do not alter the
number of elements of <code>X</code> which are identical.
</p>
</div>
</div>
