doc/manual.org
*** ModelSelectionParameter
:PROPERTIES:
:CUSTOM_ID: id-3-ModelSelectionParameter
:END:

While model selection is extremely complicated in general, it can be almost
trivial when the number of models you wish to consider is small and the models
can be regarded as special cases of either each other
(i.e. the are nested) or can easily expressed as special cases of a single
general model.

The ~ModelSelectionParameter~ is created with this kind of BSSVS-style model
selection in mind. It is a ~CalculationNode~ implementing ~Function~ which takes
one or more parameters (also ~Function~s) as input, together with an
~IntegerParameter~ known as the selection index. The ~ModelSelectionParameter~
acts as though it is the parameter specified by the selection index.

The simplest application of this is to allow BEAST to select between models
1 and 2, where in model 1 a parameter (eg the extinction rate) is zero, while
in model 2 the extinction rate has some unknown non-zero value.

We can implement this by defining the death rate to be a ~ModelSelectionParameter~:
#+begin_src xml
<deathRate id="deathRate" spec="ModelSelectionParameter">
    <parameter spec="RealParameter" value="0.0"/>
    <parameter id="nonZeroDeathRate" spec="RealParameter" value="1.0"/>
    <selectionIndices id="selectionIdx" spec="IntegerParameter" value="1" lower="0" upper="1"/>
</deathRate>
#+end_src
We then use this "deathRate" parameter as input to the tree prior, place some
sensible prior on "nonZeroDeathRate", and add an operator to modify the
"selectionIdx" ~IntegerParameter~.  The result is equivalent to placing a
"spike and slab" prior on the death rate parameter, which is a mixture between
a point mass at zero and whatever prior you place on "nonZeroDeathRate".

In addition to this simple case, if "selectionIndices" is an ~IntegerParameter~
with more than one element, the additional ~ModelSelectionParameter~ input,
"thisIndex", can be used to specify which element to use to select the parameter.
This allows you to sample across models where, for example, subsets of different
parameters are allowed to be exactly equal.  In this case, each model parameter
is its own ~ModelSelectionParameter~, shares exactly the same set of 
"parameter" and "selectionIndices" inputs, but has its own unique value of
"thisIndex".

Beware that ~ModelSelectionParameter~ is that is only compatible with
distributions which take ~Function~ objects rather than
~RealParameter~ objects as input.

** Operators
:PROPERTIES:
:CUSTOM_ID: id-2-Operators
:END:
*** Scaling subsets of RealParameter elements together
:PROPERTIES:
:CUSTOM_ID: id-3-Scaling-subsets-of-RealParameter-elements-together
:END:

It's occasionally necessary to tie multiple elements of a RealParameter
together, for instance to represent a vector of rates where a subset of
these rates are conditioned to be identical.  The ~BlockScaleOperator~
operator makes this possible.  It behaves essentially identically to the
standard BEAST 2 ~ScaleOperator~, with inputs "parameter" and "indicator"
specifying respectively the ~RealParameter~ to scale and the ~BooleanParameter~
indicating which elements to scale.  The differences are that ~BlockScaleOperator~

  1. _always_ scales the selected elements together (i.e. using the same
      scale factor), and
  2. it correctly takes into account the number of degrees of freedom
     (i.e. unique element values) among the selected elements.
     
An example usage of this operator is as follows:
#+begin_src xml
<operator spec="BlockScaleOperator" parameter="@paramToScale"
          scaleFactor="0.8" weight="1.0">
    <indicator spec="BooleanParameter" value="true true false false" estimate="false"/>
</operator>
#+end_src
Here "@paramToScale" references a ~RealParameter~ with 4 elements, and the
operator jointly scales the first two.

An alternative approach is available in the ~SmartScaleOperator~, which
does not use indicator variables but instead considers elements with
identical values to represent the same random variable.  Thus, the following
achieves the same result as above, with the added requirement that values
to be scaled together must be initialised to the same value:

#+begin_src xml
<state>
    <stateNode spec="RealParameter" id="paramToScale" value="1 1 2 2"/>
</state>

<operator spec="SmartScaleOperator" parameter="@paramToScale"
          scaleFactor="0.8" weight="1.0"/>
#+end_src

The ~SmartRealRandomWalkOperator~ acts analogously, but implements a random
walk equivalent to BEAST's ~RealRandomWalkOperator~ applied only to unique
elements.

