doc/index.html
<div id="outline-container-id-3-ModelSelectionParameter" class="outline-4">
<h4 id="id-3-ModelSelectionParameter"><span class="section-number-4">2.5.2.</span> ModelSelectionParameter</h4>
<div class="outline-text-4" id="text-id-3-ModelSelectionParameter">
<p>
While model selection is extremely complicated in general, it can be almost
trivial when the number of models you wish to consider is small and the models
can be regarded as special cases of either each other
(i.e. the are nested) or can easily expressed as special cases of a single
general model.
</p>

<p>
The <code>ModelSelectionParameter</code> is created with this kind of BSSVS-style model
selection in mind. It is a <code>CalculationNode</code> implementing <code>Function</code> which takes
one or more parameters (also <code>Function~s) as input, together with an
~IntegerParameter</code> known as the selection index. The <code>ModelSelectionParameter</code>
acts as though it is the parameter specified by the selection index.
</p>

<p>
The simplest application of this is to allow BEAST to select between models
1 and 2, where in model 1 a parameter (eg the extinction rate) is zero, while
in model 2 the extinction rate has some unknown non-zero value.
</p>

<p>
We can implement this by defining the death rate to be a <code>ModelSelectionParameter</code>:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">deathRate</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"deathRate"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"ModelSelectionParameter"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">parameter</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"0.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">parameter</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"nonZeroDeathRate"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">selectionIndices</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"selectionIdx"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"IntegerParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">lower</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">upper</span>=<span class="org-string">"1"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">deathRate</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
We then use this "deathRate" parameter as input to the tree prior, place some
sensible prior on "nonZeroDeathRate", and add an operator to modify the
"selectionIdx" <code>IntegerParameter</code>.  The result is equivalent to placing a
"spike and slab" prior on the death rate parameter, which is a mixture between
a point mass at zero and whatever prior you place on "nonZeroDeathRate".
</p>

<p>
In addition to this simple case, if "selectionIndices" is an <code>IntegerParameter</code>
with more than one element, the additional <code>ModelSelectionParameter</code> input,
"thisIndex", can be used to specify which element to use to select the parameter.
This allows you to sample across models where, for example, subsets of different
parameters are allowed to be exactly equal.  In this case, each model parameter
is its own <code>ModelSelectionParameter</code>, shares exactly the same set of 
"parameter" and "selectionIndices" inputs, but has its own unique value of
"thisIndex".
</p>

<p>
Beware that <code>ModelSelectionParameter</code> is that is only
compatible with distributions which take <code>Function~s rather than ~RealParameter</code>
s as input.
</p>
</div>
</div>
</div>

<div id="outline-container-id-2-Operators" class="outline-3">
<h3 id="id-2-Operators"><span class="section-number-3">2.6.</span> Operators</h3>
<div class="outline-text-3" id="text-id-2-Operators">
</div>
<div id="outline-container-id-3-Scaling-subsets-of-RealParameter-elements-together" class="outline-4">
<h4 id="id-3-Scaling-subsets-of-RealParameter-elements-together"><span class="section-number-4">2.6.1.</span> Scaling subsets of RealParameter elements together</h4>
<div class="outline-text-4" id="text-id-3-Scaling-subsets-of-RealParameter-elements-together">
<p>
It's occasionally necessary to tie multiple elements of a RealParameter
together, for instance to represent a vector of rates where a subset of
these rates are conditioned to be identical.  The <code>BlockScaleOperator</code>
operator makes this possible.  It behaves essentially identically to the
standard BEAST 2 <code>ScaleOperator</code>, with inputs "parameter" and "indicator"
specifying respectively the <code>RealParameter</code> to scale and the <code>BooleanParameter</code>
indicating which elements to scale.  The differences are that <code>BlockScaleOperator</code>
</p>

<ol class="org-ol">
<li><span class="underline">always</span> scales the selected elements together (i.e. using the same
scale factor), and</li>
<li>it correctly takes into account the number of degrees of freedom
(i.e. unique element values) among the selected elements.</li>
</ol>

<p>
An example usage of this operator is as follows:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">operator</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"BlockScaleOperator"</span> <span class="org-nxml-attribute-local-name">parameter</span>=<span class="org-string">"@paramToScale"</span>
          <span class="org-nxml-attribute-local-name">scaleFactor</span>=<span class="org-string">"0.8"</span> <span class="org-nxml-attribute-local-name">weight</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">indicator</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"BooleanParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"true true false false"</span> <span class="org-nxml-attribute-local-name">estimate</span>=<span class="org-string">"false"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">operator</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
Here "@paramToScale" references a <code>RealParameter</code> with 4 elements, and the
operator jointly scales the first two.
</p>

<p>
An alternative approach is available in the <code>SmartScaleOperator</code>, which
does not use indicator variables but instead considers elements with
identical values to represent the same random variable.  Thus, the following
achieves the same result as above, with the added requirement that values
to be scaled together must be initialised to the same value:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">state</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">stateNode</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"paramToScale"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1 1 2 2"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">state</span><span class="org-nxml-tag-delimiter">&gt;</span>

<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">operator</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"SmartScaleOperator"</span> <span class="org-nxml-attribute-local-name">parameter</span>=<span class="org-string">"@paramToScale"</span>
          <span class="org-nxml-attribute-local-name">scaleFactor</span>=<span class="org-string">"0.8"</span> <span class="org-nxml-attribute-local-name">weight</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The <code>SmartRealRandomWalkOperator</code> acts analogously, but implements a random
walk equivalent to BEAST's <code>RealRandomWalkOperator</code> applied only to unique
elements.
</p>
</div>
</div>
