doc/manual.org
*** Sampling from a discrete set of states
:PROPERTIES:
:CUSTOM_ID: id-3-Sampling-from-a-discrete-set-of-states
:END:
Occasionally we wish to characterise the posterior for a parameter or tree
which is constrained to a small set of discrete traits.  This can be
accomplished using the ~DiscreteUniformJumpOperator~.

For instance, suppose we have a small set of trees we want the MCMC to
sample from.  We can accomplish this as follows:
#+begin_src xml
<operator spec="DiscreteUniformJumpOperator" x="@tree" weight="1">
  <possibility spec="TreeParser" adjustTipHeight="false" taxa="@alignment" estimate="false"
               newick="((((1:0.232 ..."/>
  <possibility spec="TreeParser" adjustTipHeight="false" taxa="@alignment" estimate="false"
               newick="(((5:1.2321 ..."/>
  <possibility spec="TreeParser" adjustTipHeight="false" taxa="@alignment" estimate="false"
               newick="((((3:4.222 ..."/>
</operator>
#+end_src
where the "..." are the remainder of the newick strings.

Take care when using this operator that the state nodes specified by
the ~<possibility/>~ elements are actually possible values of ~x~.
I.e. parameters must have the same dimension and satisfy the bounds of
~x~, and trees must correspond to the same set of taxa as ~x~.

** Model validation 
:PROPERTIES:
:CUSTOM_ID: id-2-Model-validation
:END:
*** Easy state simulation
:PROPERTIES:
:CUSTOM_ID: id-3-Easy-state-simulation
:END:

One BEAST 2 idiom which is pervasive in my code at least is the existance
of StateNodes that initialize their own state stochastically.  ~RandomTree~
is an example of this in the core: this class is a ~Tree~ that initializes
itself by drawing from a coalescent distribution with a given population
function.

While such classes usually exist to choose a starting state for the
MCMC chain, it is often necessary - particularly in the validation phase
of model development - to simulate a large number of instances of this
simulated state.  This is usually because the simulation is often done from some
known distribution, which can then be compared against the output of MCMC.

The class ~feast.simulation.GPSimulator~ (from "general purpose simulator")
class simply makes it possible to configure this kind of simulation using
a BEAST XML file.  It is simply a ~beast.core.Runnable~ that takes a ~BEASTObject~
as input, a number of iterations and some loggers. For each iteration, it then simply calls the
~BEASTObject~'s ~initAndValidate~ method and tells the loggers to write their
results.

See ~examples/SimulateCoalescentTrees.xml~ for an example of using ~GPSimulator~
to simulate 100 coalescent trees.
*** Sequence alignment simulation
:PROPERTIES:
:CUSTOM_ID: id-3-Sequence-alignment-simulation
:END:

While BEAST contains its own alignment simulator in ~beast.app.seqgen.SimulatedAlignment~,
this can be awkward to use as it requires pre-specifying the taxa to associate
with the simulated alignment.

The ~feast.simulation.SimulatedAlignment~ class is a simpler alignment simulator
which lifts this requirement.  For example, the following will initialize
an alignment by simulating sequences down the input tree using a Jukes-Cantor
substitution model:

#+begin_src xml
<alignment spec="feast.simulation.SimulatedAlignment"
           outputFileName="simulated_alignment.nexus"
           tree="@tree" sequenceLength="1000">
    <siteModel spec="SiteModel">
        <substModel spec="JukesCantor"/>
    </siteModel>
</alignment>
#+end_src

The class supports the same inputs as ~Alignment~ and ~beast.app.seqgen.SimulatedAlignment~,
with the exception that the ~data~ input should be omitted - it will cause
strange errors if you include it.  Also, only strict clocks are currently
supported, so there is no ~branchRateModel~ input.
