doc/index.html

<div id="outline-container-id-3-Sampling-from-a-discrete-set-of-states" class="outline-4">
<h4 id="id-3-Sampling-from-a-discrete-set-of-states"><span class="section-number-4">2.6.2.</span> Sampling from a discrete set of states</h4>
<div class="outline-text-4" id="text-id-3-Sampling-from-a-discrete-set-of-states">
<p>
Occasionally we wish to characterise the posterior for a parameter or tree
which is constrained to a small set of discrete traits.  This can be
accomplished using the <code>DiscreteUniformJumpOperator</code>.
</p>

<p>
For instance, suppose we have a small set of trees we want the MCMC to
sample from.  We can accomplish this as follows:
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">operator</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"DiscreteUniformJumpOperator"</span> <span class="org-nxml-attribute-local-name">x</span>=<span class="org-string">"@tree"</span> <span class="org-nxml-attribute-local-name">weight</span>=<span class="org-string">"1"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">possibility</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TreeParser"</span> <span class="org-nxml-attribute-local-name">adjustTipHeight</span>=<span class="org-string">"false"</span> <span class="org-nxml-attribute-local-name">taxa</span>=<span class="org-string">"@alignment"</span> <span class="org-nxml-attribute-local-name">estimate</span>=<span class="org-string">"false"</span>
               <span class="org-nxml-attribute-local-name">newick</span>=<span class="org-string">"((((1:0.232 ..."</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">possibility</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TreeParser"</span> <span class="org-nxml-attribute-local-name">adjustTipHeight</span>=<span class="org-string">"false"</span> <span class="org-nxml-attribute-local-name">taxa</span>=<span class="org-string">"@alignment"</span> <span class="org-nxml-attribute-local-name">estimate</span>=<span class="org-string">"false"</span>
               <span class="org-nxml-attribute-local-name">newick</span>=<span class="org-string">"(((5:1.2321 ..."</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">possibility</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TreeParser"</span> <span class="org-nxml-attribute-local-name">adjustTipHeight</span>=<span class="org-string">"false"</span> <span class="org-nxml-attribute-local-name">taxa</span>=<span class="org-string">"@alignment"</span> <span class="org-nxml-attribute-local-name">estimate</span>=<span class="org-string">"false"</span>
               <span class="org-nxml-attribute-local-name">newick</span>=<span class="org-string">"((((3:4.222 ..."</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">operator</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
where the "&#x2026;" are the remainder of the newick strings.
</p>

<p>
Take care when using this operator that the state nodes specified by
the <code>&lt;possibility/&gt;</code> elements are actually possible values of <code>x</code>.
I.e. parameters must have the same dimension and satisfy the bounds of
<code>x</code>, and trees must correspond to the same set of taxa as <code>x</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-id-2-Model-validation" class="outline-3">
<h3 id="id-2-Model-validation"><span class="section-number-3">2.7.</span> Model validation</h3>
<div class="outline-text-3" id="text-id-2-Model-validation">
</div>
<div id="outline-container-id-3-Easy-state-simulation" class="outline-4">
<h4 id="id-3-Easy-state-simulation"><span class="section-number-4">2.7.1.</span> Easy state simulation</h4>
<div class="outline-text-4" id="text-id-3-Easy-state-simulation">
<p>
One BEAST 2 idiom which is pervasive in my code at least is the existance
of StateNodes that initialize their own state stochastically.  <code>RandomTree</code>
is an example of this in the core: this class is a <code>Tree</code> that initializes
itself by drawing from a coalescent distribution with a given population
function.
</p>

<p>
While such classes usually exist to choose a starting state for the
MCMC chain, it is often necessary - particularly in the validation phase
of model development - to simulate a large number of instances of this
simulated state.  This is usually because the simulation is often done from some
known distribution, which can then be compared against the output of MCMC.
</p>

<p>
The class <code>feast.simulation.GPSimulator</code> (from "general purpose simulator")
class simply makes it possible to configure this kind of simulation using
a BEAST XML file.  It is simply a <code>beast.core.Runnable</code> that takes a <code>BEASTObject</code>
as input, a number of iterations and some loggers. For each iteration, it then simply calls the
<code>BEASTObject</code>'s <code>initAndValidate</code> method and tells the loggers to write their
results.
</p>

<p>
See <code>examples/SimulateCoalescentTrees.xml</code> for an example of using <code>GPSimulator</code>
to simulate 100 coalescent trees.
</p>
</div>
</div>
<div id="outline-container-id-3-Sequence-alignment-simulation" class="outline-4">
<h4 id="id-3-Sequence-alignment-simulation"><span class="section-number-4">2.7.2.</span> Sequence alignment simulation</h4>
<div class="outline-text-4" id="text-id-3-Sequence-alignment-simulation">
<p>
While BEAST contains its own alignment simulator in <code>beast.app.seqgen.SimulatedAlignment</code>,
this can be awkward to use as it requires pre-specifying the taxa to associate
with the simulated alignment.
</p>

<p>
The <code>feast.simulation.SimulatedAlignment</code> class is a simpler alignment simulator
which lifts this requirement.  For example, the following will initialize
an alignment by simulating sequences down the input tree using a Jukes-Cantor
substitution model:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">alignment</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.simulation.SimulatedAlignment"</span>
           <span class="org-nxml-attribute-local-name">outputFileName</span>=<span class="org-string">"simulated_alignment.nexus"</span>
           <span class="org-nxml-attribute-local-name">tree</span>=<span class="org-string">"@tree"</span> <span class="org-nxml-attribute-local-name">sequenceLength</span>=<span class="org-string">"1000"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">siteModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"SiteModel"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">substModel</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"JukesCantor"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">siteModel</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">alignment</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The class supports the same inputs as <code>Alignment</code> and <code>beast.app.seqgen.SimulatedAlignment</code>,
with the exception that the <code>data</code> input should be omitted - it will cause
strange errors if you include it.  Also, only strict clocks are currently
supported, so there is no <code>branchRateModel</code> input.
</p>
</div>
</div>
