doc/manual.org
*** DensityMapper
:PROPERTIES:
:CUSTOM_ID: id-3-DensityMapper
:END:

This class provides an easy way to produce plots of the variation in a
particular ~Distribution~ (i.e. probability density) as a function of one or
more parameters.  The class extends the BEAST ~Runnable~ abstract class and
thus takes the place of the ~MCMC~ class in a regular BEAST XML.  To use
~DensityMapper~ you'll therefore need to create an XML with the following
general form:

#+begin_src xml
<beast version="2.0">
    <run spec="DensityMapper">
        <distribution id="distrib" ... />

        <realParam spec="RealParameter" id="paramA"
            value="V_A" lower="LOWER_A" upper="UPPER_A"/>
        <steps spec="IntegerParameter"
            value="STEPS_A"/>

        <realParam spec="RealParameter" id="paramB"
            value="V_B1 V_B2" lower="LOWER_B" upper="UPPER_B"/>
        <steps spec="IntegerParameter"
            value="STEPS_B1 STEPS_B2"/>

        <logger spec="Logger" logEvery="1">
            <log idref="paramA"/>
            <log idref="paramB"/>
            <log idref="distrib"/>
        </logger>

        <!-- Additional (screen?) loggers -->
    </run>
</beast>
#+end_src

The ~<realParam>~ elements specify which parameters are varied, the upper and
lower bounds of these parameters specify the range over which the parameter is
varied, and the corresponding ~<steps>~ elements specify the number of steps to
use for each parameter. When the number of steps is 1 the parameter is not
varied and instead the contents of the ~value~ attribute is used.

When parameters are vectors, the associated ~<steps>~ parameter may have
dimension 1 in which case all elements of the vector parameter are varied
together (e.g. [0,0], [0.1,0.1], ..., [1, 1]).  Alternatively, the steps
parameter may have dimension equal to that of the real parameter in which case
each element of the parameter is varied independently with the corresponding
number of steps (e.g. [0,0], [0, 0.1], ..., [0, 1], [0.1, 0.0], ..., [1, 1]).
To keep one component of a vector parameter fixed, set the corresponding steps
element to 1.

If, in addition to the ~<realParam>~ and ~<steps>~ elements a
~<logScale>~ BooleanParameter element is provided, DensityMapper will
evaluate the densities at a logarithmic distribution of parameter
values between the same bounds.  I.e., the following snippet will
cause ~paramA~ to be set to values logarithmically distributed between
LOWER_A and UPPER_A:

#+begin_src xml
        <realParam spec="RealParameter" id="paramA"
            value="V_A" lower="LOWER_A" upper="UPPER_A"/>
        <steps spec="IntegerParameter"
            value="STEPS_A"/>
        <logScale spec="BooleanParameter"
            value="true"/>
#+end_src

Take care that if the log-scale element is provided for one parameter that it is
also provided for all other parameters.

An example usage of ~DensityMapper~ which produces the variation in a
coalescent tree density as a function of the population size is provided as
~DensityMapper.xml~ which can be found in the examples directory.

** Function (array) creation and manipulation
:PROPERTIES:
:CUSTOM_ID: id-2-Function-(array)-creation-and-manipulation
:END:

This section describes feast classes which implement the BEAST 2 ~Function~ interface.
A ~Function~ here refers to an array of real numbers.  (The naming is an unfortunate
historical decision.)  Many ~BEASTObject~ classes implement ~Function~, including ~RealParameter~
and ~Tree~.  (In the example of ~Tree~, the real numbers represent node ages.)

Many of the classes here take one or more ~Function~ objects as input,
and act to transform or combine the inputs to yield the value of the
output ~Function~.   This means that instances of these classes can be chained
so as to achieve a variety of fairly complex transformations.

Note that all of the classes discussed here also implement the ~Loggable~ interface,
meaning that they can be passed directly as inputs to the ~<logger/>~ elements in the
XML.

*** Numeric sequences as Functions
:PROPERTIES:
:CUSTOM_ID: id-3-Numeric-sequences-as-Functions
:END:

An instance of ~feast.function.Sequence~ is a ~Function~ which contains a sequence
of numbers evenly separated between two bounds.  For instance, the following
XML fragment represents a sequence of 101 numbers evenly spaced between 0 and 10,
i.e. 0,0.1,0.2,...,9.9,10:

#+begin_src xml
<function spec="feast.function.Sequence" start="0" stop="10" length="101"/>
#+end_src
