doc/index.html
<div id="outline-container-id-3-DensityMapper" class="outline-4">
<h4 id="id-3-DensityMapper"><span class="section-number-4">2.7.3.</span> DensityMapper</h4>
<div class="outline-text-4" id="text-id-3-DensityMapper">
<p>
This class provides an easy way to produce plots of the variation in a
particular <code>Distribution</code> (i.e. probability density) as a function of one or
more parameters.  The class extends the BEAST <code>Runnable</code> abstract class and
thus takes the place of the <code>MCMC</code> class in a regular BEAST XML.  To use
<code>DensityMapper</code> you'll therefore need to create an XML with the following
general form:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">beast</span> <span class="org-nxml-attribute-local-name">version</span>=<span class="org-string">"2.0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">run</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"DensityMapper"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">distribution</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"distrib"</span> ... <span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>

        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">realParam</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"paramA"</span>
            <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"V_A"</span> <span class="org-nxml-attribute-local-name">lower</span>=<span class="org-string">"LOWER_A"</span> <span class="org-nxml-attribute-local-name">upper</span>=<span class="org-string">"UPPER_A"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">steps</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"IntegerParameter"</span>
            <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"STEPS_A"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>

        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">realParam</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"paramB"</span>
            <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"V_B1 V_B2"</span> <span class="org-nxml-attribute-local-name">lower</span>=<span class="org-string">"LOWER_B"</span> <span class="org-nxml-attribute-local-name">upper</span>=<span class="org-string">"UPPER_B"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">steps</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"IntegerParameter"</span>
            <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"STEPS_B1 STEPS_B2"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>

        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logger</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"Logger"</span> <span class="org-nxml-attribute-local-name">logEvery</span>=<span class="org-string">"1"</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"paramA"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"paramB"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">log</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"distrib"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">logger</span><span class="org-nxml-tag-delimiter">&gt;</span>

        <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Additional (screen?) loggers</span><span class="org-comment-delimiter"> --&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">run</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">beast</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The <code>&lt;realParam&gt;</code> elements specify which parameters are varied, the upper and
lower bounds of these parameters specify the range over which the parameter is
varied, and the corresponding <code>&lt;steps&gt;</code> elements specify the number of steps to
use for each parameter. When the number of steps is 1 the parameter is not
varied and instead the contents of the <code>value</code> attribute is used.
</p>

<p>
When parameters are vectors, the associated <code>&lt;steps&gt;</code> parameter may have
dimension 1 in which case all elements of the vector parameter are varied
together (e.g. [0,0], [0.1,0.1], &#x2026;, [1, 1]).  Alternatively, the steps
parameter may have dimension equal to that of the real parameter in which case
each element of the parameter is varied independently with the corresponding
number of steps (e.g. [0,0], [0, 0.1], &#x2026;, [0, 1], [0.1, 0.0], &#x2026;, [1, 1]).
To keep one component of a vector parameter fixed, set the corresponding steps
element to 1.
</p>

<p>
If, in addition to the <code>&lt;realParam&gt;</code> and <code>&lt;steps&gt;</code> elements a
<code>&lt;logScale&gt;</code> BooleanParameter element is provided, DensityMapper will
evaluate the densities at a logarithmic distribution of parameter
values between the same bounds.  I.e., the following snippet will
cause <code>paramA</code> to be set to values logarithmically distributed between
LOWER<sub>A</sub> and UPPER<sub>A</sub>:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">realParam</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"paramA"</span>
    <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"V_A"</span> <span class="org-nxml-attribute-local-name">lower</span>=<span class="org-string">"LOWER_A"</span> <span class="org-nxml-attribute-local-name">upper</span>=<span class="org-string">"UPPER_A"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">steps</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"IntegerParameter"</span>
    <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"STEPS_A"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">logScale</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"BooleanParameter"</span>
    <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"true"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Take care that if the log-scale element is provided for one parameter that it is
also provided for all other parameters.
</p>

<p>
An example usage of <code>DensityMapper</code> which produces the variation in a
coalescent tree density as a function of the population size is provided as
<code>DensityMapper.xml</code> which can be found in the examples directory.
</p>
</div>
</div>
</div>

<div id="outline-container-id-2-Function-(array)-creation-and-manipulation" class="outline-3">
<h3 id="id-2-Function-(array)-creation-and-manipulation"><span class="section-number-3">2.8.</span> Function (array) creation and manipulation</h3>
<div class="outline-text-3" id="text-id-2-Function-(array)-creation-and-manipulation">
</div>
<div id="outline-container-id-3-Numeric-sequences-as-Functions" class="outline-4">
<h4 id="id-3-Numeric-sequences-as-Functions"><span class="section-number-4">2.8.1.</span> Numeric sequences as Functions</h4>
<div class="outline-text-4" id="text-id-3-Numeric-sequences-as-Functions">
<p>
Instances of <code>feast.function.Sequence</code> are ~Function~s which contain a sequence
of numbers evenly separated between two bounds.  For instance, the following
XML fragment represents a sequence of 101 numbers evenly spaced between 0 and 10,
i.e. 0,0.1,0.2,&#x2026;,9.9,10:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">function</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.Sequence"</span> <span class="org-nxml-attribute-local-name">start</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">stop</span>=<span class="org-string">"10"</span> <span class="org-nxml-attribute-local-name">length</span>=<span class="org-string">"101"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
