doc/manual.org
*** Function Slicing
:PROPERTIES:
:CUSTOM_ID: id-3-Function-Slicing
:END:

An instance of the ~feast.function.Slice~ class is a ~Function~ which
represent or more elements of another ~Function~.  This allows
element-specific priors to be set, and individual elements to be logged.

Here's a simple example of using ~Slice~ to place a prior on a subset of elements
of a ~RealParameter~:

#+begin_src xml
<distrib spec="Prior">
    <x spec="feast.function.Slice" arg="@samplingProportion" index="2" count="1"/>
    <distr spec="LogNormalDistributionModel" M="0" S="1"/>
</distrib>
#+end_src

The optional ~by~ input can be used to increase the step size between elements.  For
example, here's how one could use ~Slice~ to apply a prior to elements 1,3,5 of the
same ~RealParamter~:

#+begin_src xml
<distrib spec="Prior">
    <x spec="feast.function.Slice" arg="@samplingProportion" index="1" count="3" by="2"/>
</distrib>
#+end_src
*** Function reversing
:PROPERTIES:
:CUSTOM_ID: id-3-Function-reversing
:END:

Instances of the ~feast.function.Reverse~ class are
~Funtion~ and ~Loggable~ which represent the elements of another
~Function~ but in reverse order.
*** Function concatenation
:PROPERTIES:
:CUSTOM_ID: id-3-Function-concatenation
:END:

An instance of the ~feast.function.Concatenate~ class is a ~Function~
whose elements are composed of the elements of their
input ~Function~ objects joined together.  For example, here is a ~Function~
representing a piecewise constant reproductive number to be used as
input to the BDSKY tree prior, but composed of distinct input parameters
rather than a single real parameter with multiple dimensions:

#+begin_src xml
<reproductiveNumber spec="feast.function.Concatenate">
    <arg spec="RealParameter" value="1.0"/>
    <arg spec="RealParameter" value="2.0"/>
</reproductiveNumber>
#+end_src
*** Function scaling
:PROPERTIES:
:CUSTOM_ID: id-3-Function-scaling
:END:

Instances of ~feast.function.Scale~ allow one ~Function~ to be scaled
by another:

#+begin_src xml
<scaledBirthRate spec="feast.function.Scale">
  <function spec="RealParameter" value="1.0 2.0 3.0"/>
  <scaleBy spec="RealParameter" value="1.5"/>
</scaledBirthRate>
#+end_src
*** Function interleaving
:PROPERTIES:
:CUSTOM_ID: id-3-Function-interleaving
:END:

Instances of ~feast.function.Interleave~ represent the result of interleaving
the elements of several input ~Function~ objects.  For example:

#+begin_src xml
<twoDemeBirthRate spec="feast.function.interleave">
  <arg spec="RealParameter" value="1 3 5 7"/>
  <arg spec="RealParameter" value="2 4 6 8"/>
</twoDemeBirthRate>
#+end_src

is as a ~Function~ with elements 1,2,3,4,5,6,7,8.

Finally, instances of ~feast.function.UniqueElementCount~ are
~Function~ objects which contain a single integer representing the
number of unique values contained in the elements of an input
~Function~.  For example,

#+begin_src xml
<uniqueValues spec="feast.function.UniqueElementCount">
    <arg spec="RealParameter" value="1.5 10 1.5 1.4"/>
</uniqueValues>
#+end_src

is a ~Function~ with a value of 3.


** Tree and Alignment Input/Output
:PROPERTIES:
:CUSTOM_ID: id-2-Tree-and-Alignment-Input/Output
:END:
