doc/index.html
<div id="outline-container-id-3-Function-Slicing" class="outline-4">
<h4 id="id-3-Function-Slicing"><span class="section-number-4">2.8.2.</span> Function Slicing</h4>
<div class="outline-text-4" id="text-id-3-Function-Slicing">
<p>
Instances of the <code>feast.function.Slice</code> class are <code>Function~s and ~Loggable~s which
represent or more elements of another ~Function</code>.  This allows
element-specific priors to be set, and individual elements to be logged.
</p>

<p>
Here's a simple example of using <code>Slice</code> to place a prior on a subset of elements
of a <code>RealParameter</code>:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">distrib</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"Prior"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">x</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.Slice"</span> <span class="org-nxml-attribute-local-name">arg</span>=<span class="org-string">"@samplingProportion"</span> <span class="org-nxml-attribute-local-name">index</span>=<span class="org-string">"2"</span> <span class="org-nxml-attribute-local-name">count</span>=<span class="org-string">"1"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">distr</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"LogNormalDistributionModel"</span> <span class="org-nxml-attribute-local-name">M</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">S</span>=<span class="org-string">"1"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">distrib</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The optional <code>by</code> input can be used to increase the step size between elements.  For
example, here's how one could use <code>Slice</code> to apply a prior to elements 1,3,5 of the
same <code>RealParamter</code>:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">distrib</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"Prior"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">x</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.Slice"</span> <span class="org-nxml-attribute-local-name">arg</span>=<span class="org-string">"@samplingProportion"</span> <span class="org-nxml-attribute-local-name">index</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">count</span>=<span class="org-string">"3"</span> <span class="org-nxml-attribute-local-name">by</span>=<span class="org-string">"2"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">distrib</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-id-3-Function-reversing" class="outline-4">
<h4 id="id-3-Function-reversing"><span class="section-number-4">2.8.3.</span> Function reversing</h4>
<div class="outline-text-4" id="text-id-3-Function-reversing">
<p>
Instances of the <code>feast.function.Reverse</code> class are
<code>Funtion~s and ~Loggable~s which represent the elements of another
~Function</code> but in reverse order.
</p>
</div>
</div>
<div id="outline-container-id-3-Function-concatenation" class="outline-4">
<h4 id="id-3-Function-concatenation"><span class="section-number-4">2.8.4.</span> Function concatenation</h4>
<div class="outline-text-4" id="text-id-3-Function-concatenation">
<p>
Instances of the <code>feast.function.Concatenate</code> class are ~Function~s
and <code>Loggable~s whose elements are composed of the elements of their
input ~Function~s joined together.  For example, here is a ~Function</code>
representing a piecewise constant reproductive number to be used as
input to the BDSKY tree prior, but composed of distinct input parameters
rather than a single real parameter with multiple dimensions:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">reproductiveNumber</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.Concatenate"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"2.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">reproductiveNumber</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-id-3-Function-scaling" class="outline-4">
<h4 id="id-3-Function-scaling"><span class="section-number-4">2.8.5.</span> Function scaling</h4>
<div class="outline-text-4" id="text-id-3-Function-scaling">
<p>
Instances of <code>feast.function.Scale</code> allow one <code>Function</code> to be scaled
by another:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">scaledBirthRate</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.Scale"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">function</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.0 2.0 3.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">scaleBy</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.5"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">scaledBirthRate</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-id-3-Function-interleaving" class="outline-4">
<h4 id="id-3-Function-interleaving"><span class="section-number-4">2.8.6.</span> Function interleaving</h4>
<div class="outline-text-4" id="text-id-3-Function-interleaving">
<p>
Instances of <code>feast.function.Interleave</code> represent the result of interleaving
the elements of several input ~Function~s.  For example:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">twoDemeBirthRate</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.interleave"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1 3 5 7"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"2 4 6 8"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">twoDemeBirthRate</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
is as a <code>Function</code> with elements 1,2,3,4,5,6,7,8.
</p>

<p>
Finally, instances of <code>feast.function.UniqueElementCount</code> are ~Function~s which
contain a single integer representing the number of unique values contained
in the elements of an input <code>Function</code>.  For example,
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">uniqueValues</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.function.UniqueElementCount"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">arg</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"RealParameter"</span> <span class="org-nxml-attribute-local-name">value</span>=<span class="org-string">"1.5 10 1.5 1.4"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">uniqueValues</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
is a <code>Function</code> with a value of 3.
</p>
</div>
</div>
</div>


<div id="outline-container-id-2-Tree-and-Alignment-Input/Output" class="outline-3">
<h3 id="id-2-Tree-and-Alignment-Input/Output"><span class="section-number-3">2.9.</span> Tree and Alignment Input/Output</h3>
<div class="outline-text-3" id="text-id-2-Tree-and-Alignment-Input/Output">
</div>
