doc/manual.org
*** TreeFromNewickFile & TreeFromNexusFile
:PROPERTIES:
:CUSTOM_ID: id-3-TreeFromNewickFile-&-TreeFromNexusFile
:END:

These classes allow trees to be loaded at runtime from Newick files rather
than stored in the BEAST 2 XML:

#+begin_src xml
<tree spec='feast.fileio.TreeFromNewickFile' fileName="example.tree"
    IsLabelledNewick="true" adjustTipHeights="false" .../>
#+end_src
or 
#+begin_src xml
<tree spec='feast.fileio.TreeFromNexusFile' fileName="example.nexus"
    IsLabelledNewick="true" adjustTipHeights="false" .../>
#+end_src

The optional attribute ~treeIndex~ can be used to specify the index (starting
from zero) of the tree to read from the file.

For Nexus files, only the first trees block encountered is processed.

Both classes are thin wrappers around ~TreeParser~, so all of the various inputs
supported by that class are also supported. In particular, setting ~adjustTipHeights~
to "true" causes all tip ages to be set to zero, which is sometimes desirable
when reading in trees with only extant tips in order to avoid rounding errors.
(Such rounding errors can cause problems with tree priors such as BDSKY
which use the age of tips to classify samples as resulting from
ρ-sampling or ψ-sampling.)

*** TraitSetFromTaxonSet
:PROPERTIES:
:CUSTOM_ID: id-3-TraitSetFromTaxonSet
:END:

This class allows ~TraitSet~ objects to be configured directly from
~TaxonSet~ objects.  This is similar in spirit to the "auto
configuration" option provided by BEAUti to set up tree tip dates from
information encoded in the sequence names.  While it's not directly
i/o related, it solves a common problem that occurs when trees are
loaded from an external file.

Use this as you would usually use a ~TraitSet~, but instead of including the
trait assignments directly in the body, specify inputs indicating how to extract
the trait values from the taxon names.

For instance:

#+begin_src xml
<trait spec="feast.fileio.TraitSetFromTaxonSet"
       delimiter="|"
       everythingAfterLast="true"
       traitname="date"
       dateFormat="yyyy-M-dd">
       <taxa id="taxonSet" spec="TaxonSet" alignment="@alignment"/>
</trait>
#+end_src

Instead of ~everythingAfterLast="true"~, one can also use ~everythingBeforeFirst="true"~ or
~takeGroup="N"~ where N is the index of the group (delimited by the chosen delimiter).

*** TraitSetFromXSV
:PROPERTIES:
:CUSTOM_ID: id-3-TraitSetFromXSV
:END:

This class allows ~TraitSet~ objects to be initialised from external
CSV/TSV files.

Use this as you would use ~TraitSet~, but instead of including the
trait assignments in the body, use the inputs to direct the class
to load the trait assignments from a file.

For example:

#+begin_src xml
  <trait spec="feast.fileio.TraitSetFromXSV"
         fileName="example.csv" sep=",">
    <taxa spec="TaxonSet" alignment="@alignment"/>
  </trait>
#+end_src

loads trait values for a taxon set from the CSV file ~example.csv~, which
would have the following format

#+begin_src csv
  first_taxon, 12.3
  second_taxon, 7.8
  third_taxon, 15.4
  ...
#+end_src

The order of the lines in the input file is not important, and any taxon
names in the file which don't match the taxa provided by the ~taxa~ input
are ignored.

By default, taxon names are read from the first column (index 0) of
the input file and values are read from the second (index 1). This
behaviour can be customized through the ~taxonNameCol~ and ~traitValueCol~
inputs, which accept the indicies of the columns to use.  All other
columns in the input file besides the two specified here are ignored,
so you can read multiple trait sets from a single file simply by
specifying different ~traitValueCol~ values.

Finally, you can set the optional input ~skipFirstRow~ to "true" to cause
~TraitSetFromXSV~ to ignore the first line of the input file.  This can
be useful for CSV/TSV files which include a header line.

*** TaxonSetFromTree
:PROPERTIES:
:CUSTOM_ID: id-3-TaxonSetFromTree
:END:

This class allows ~TaxonSet~ objects to be initialized from trees.
Like ~TraitSetFromTree~, this class doesn't perform any file i/o, but
makes it easier to work with trees loaded from external files.

An example use is:

#+begin_src xml
<taxonset spec="TaxonSetFromTree" tree="@tree"/>
#+end_src

which could be included as an input to a ~TraitSetFromXSV~ as
described in the previous section.

