doc/index.html
<div id="outline-container-id-3-TreeFromNewickFile-&-TreeFromNexusFile" class="outline-4">
<h4 id="id-3-TreeFromNewickFile-&-TreeFromNexusFile"><span class="section-number-4">2.9.1.</span> TreeFromNewickFile &amp; TreeFromNexusFile</h4>
<div class="outline-text-4" id="text-id-3-TreeFromNewickFile-&-TreeFromNexusFile">
<p>
These classes allow trees to be loaded at runtime from Newick files rather
than stored in the BEAST 2 XML:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">tree</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">'feast.fileio.TreeFromNewickFile'</span> <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"example.tree"</span>
    <span class="org-nxml-attribute-local-name">IsLabelledNewick</span>=<span class="org-string">"true"</span> <span class="org-nxml-attribute-local-name">adjustTipHeights</span>=<span class="org-string">"false"</span> ...<span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
or 
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">tree</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">'feast.fileio.TreeFromNexusFile'</span> <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"example.nexus"</span>
    <span class="org-nxml-attribute-local-name">IsLabelledNewick</span>=<span class="org-string">"true"</span> <span class="org-nxml-attribute-local-name">adjustTipHeights</span>=<span class="org-string">"false"</span> ...<span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The optional attribute <code>treeIndex</code> can be used to specify the index (starting
from zero) of the tree to read from the file.
</p>

<p>
For Nexus files, only the first trees block encountered is processed.
</p>

<p>
Both classes are thin wrappers around <code>TreeParser</code>, so all of the various inputs
supported by that class are also supported.
</p>
</div>
</div>

<div id="outline-container-id-3-TraitSetFromTaxonSet" class="outline-4">
<h4 id="id-3-TraitSetFromTaxonSet"><span class="section-number-4">2.9.2.</span> TraitSetFromTaxonSet</h4>
<div class="outline-text-4" id="text-id-3-TraitSetFromTaxonSet">
<p>
This class allows ~TraitSet~s to be configured directly from
~TaxonSet~s.  This is similar in spirit to the "auto configuration"
option provided by BEAUti to set up tree tip dates from information
encoded in the sequence names.  While it's not directly i/o related,
it solves a common problem that occurs when trees are loaded from an
external file.
</p>

<p>
Use this as you would usually use a <code>TraitSet</code>, but instead of including the
trait assignments directly in the body, specify inputs indicating how to extract
the trait values from the taxon names.
</p>

<p>
For instance:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">trait</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.TraitSetFromTaxonSet"</span>
       <span class="org-nxml-attribute-local-name">delimiter</span>=<span class="org-string">"|"</span>
       <span class="org-nxml-attribute-local-name">everythingAfterLast</span>=<span class="org-string">"true"</span>
       <span class="org-nxml-attribute-local-name">traitname</span>=<span class="org-string">"date"</span>
       <span class="org-nxml-attribute-local-name">dateFormat</span>=<span class="org-string">"yyyy-M-dd"</span><span class="org-nxml-tag-delimiter">&gt;</span>
       <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">taxa</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"taxonSet"</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TaxonSet"</span> <span class="org-nxml-attribute-local-name">alignment</span>=<span class="org-string">"@alignment"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">trait</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Instead of <code>everythingAfterLast="true"</code>, one can also use <code>everythingBeforeFirst="true"</code> or
<code>takeGroup="N"</code> where N is the index of the group (delimited by the chosen delimiter).
</p>
</div>
</div>

<div id="outline-container-id-3-TraitSetFromXSV" class="outline-4">
<h4 id="id-3-TraitSetFromXSV"><span class="section-number-4">2.9.3.</span> TraitSetFromXSV</h4>
<div class="outline-text-4" id="text-id-3-TraitSetFromXSV">
<p>
This class allows ~TraitSet~s to be initialised from external CSV/TSV files.
</p>

<p>
Use this as you would use <code>TraitSet</code>, but instead of including the
trait assignments in the body, use the inputs to direct the class
to load the trait assignments from a file.
</p>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">trait</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.TraitSetFromXSV"</span>
       <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"example.csv"</span> <span class="org-nxml-attribute-local-name">sep</span>=<span class="org-string">","</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">taxa</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TaxonSet"</span> <span class="org-nxml-attribute-local-name">alignment</span>=<span class="org-string">"@alignment"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">trait</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
loads trait values for a taxon set from the CSV file <code>example.csv</code>, which
would have the following format
</p>

<div class="org-src-container">
<pre class="src src-csv">first_taxon<span class="org-csv-separator">,</span> 12.3
second_taxon<span class="org-csv-separator">,</span> 7.8
third_taxon<span class="org-csv-separator">,</span> 15.4
...
</pre>
</div>

<p>
The order of the lines in the input file is not important, and any taxon
names in the file which don't match the taxa provided by the <code>taxa</code> input
are ignored.
</p>

<p>
By default, taxon names are read from the first column (index 0) of
the input file and values are read from the second (index 1). This
behaviour can be customized through the <code>taxonNameCol</code> and <code>traitValueCol</code>
inputs, which accept the indicies of the columns to use.  All other
columns in the input file besides the two specified here are ignored,
so you can read multiple trait sets from a single file simply by
specifying different <code>traitValueCol</code> values.
</p>

<p>
Finally, you can set the optional input <code>skipFirstRow</code> to "true" to cause
<code>TraitSetFromXSV</code> to ignore the first line of the input file.  This can
be useful for CSV/TSV files which include a header line.
</p>
</div>
</div>

<div id="outline-container-id-3-TaxonSetFromTree" class="outline-4">
<h4 id="id-3-TaxonSetFromTree"><span class="section-number-4">2.9.4.</span> TaxonSetFromTree</h4>
<div class="outline-text-4" id="text-id-3-TaxonSetFromTree">
<p>
This class allows <code>TaxonSet~s to be initialized from trees.  Like
~TraitSetFromTree</code>, this class doesn't perform any file i/o, but makes
it easier to work with trees loaded from external files.
</p>

<p>
An example use is:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">taxonset</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"TaxonSetFromTree"</span> <span class="org-nxml-attribute-local-name">tree</span>=<span class="org-string">"@tree"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
which could be included as an input to a <code>TraitSetFromXSV</code> as
described in the previous section.
</p>
</div>
</div>
