doc/manual.org
*** AlignmentFromNexus/Fasta
:PROPERTIES:
:CUSTOM_ID: id-3-AlignmentFromNexus/Fasta
:END:

This class allows alignments to be loaded at runtime from Nexus or Fasta files
rather than stored in the BEAST 2 XML:

#+begin_src xml
<!-- Nexus: -->
<alignment spec='feast.fileio.AlignmentFromNexus' fileName="example.nexus"/>

<!-- Fasta: -->
<alignment spec='feast.fileio.AlignmentFromFasta' fileName="example.fasta"/>
#+end_src

Sequence files can also be referenced using a URL:

#+begin_src xml
<!-- Nexus: -->
<alignment spec="feast.fileio.AlignmentFromNexus"
           url="https://example.com/alignment.nexus"/>

<!-- Fasta: -->
<alignment spec="feast.fileio.AlignmentFromFasta"
           url="https://example.com/alignment.fasta"/>
#+end_src

The Fasta import uses the sequence labels from the file as taxon labels.

Obviously these classes runs contrary to BEAST's philosophy of keeping
everything necessary to run an analysis in the XML file.  However, it
is sometimes convenient to be able to do this.  As a bonus, the
~xmlFileName~ attribute can be used to write the appropriate XML
fragment to disk.

** Mathematical Expressions 
:PROPERTIES:
:CUSTOM_ID: id-2-Mathematical-Expressions
:END:

The following classes, which are found in ~feast.expressions~, provide
support for parsing of simple arithmetic expressions.


*** ExpCalculator
:PROPERTIES:
:CUSTOM_ID: id-3-ExpCalculator
:END:

Takes an arithmetic expression and returns the result by acting
as a Loggable or a Function.  Binary operators can be applied to
Functions (including Parameters) of different lengths as in R, with
the result having the maximum of the two lengths, and the index into
the shortest parameter being the result index modulo the length of
that parameter. True and false are represented by 1.0 and 0.0 respectively.

Example expressions follow. (I and J are IDs of RealParameters with elements
{1.0, 2.0, 3.0} and {5.0, 10.0}, respectively.)

|-----------------------------+----------------------------|
| Expression                  | Loggable/Function value    |
|-----------------------------+----------------------------|
| 2.5*I                       | {2.5, 5.0, 7.5}            |
| I+J                         | {6.0, 12.0, 8.0}           |
| exp(I[0])                   | {2.718...}                 |
| {I,J}                       | {1.0, 2.0, 3.0, 5.0, 10.0} |
| 1:3                         | {1.0, 2.0, 3.0}            |
| J[1:0]                      | {10.0, 5.0}                |
| 1[1:3]                      | {1.0, 1.0, 1.0}            |
| -log(exp(J))/(1.5+0.5*I[0]) | {-2.5, -5.0}               |
| sqrt(J)                     | {2.236..., 3.162...}       |
| J!                          | {1.0, 2.0, 6.0}            |
| 2^I                         | {2.0, 4.0, 6.0}            |
| sum(I)                      | {6.0}                      |
| cumsum(I)                   | {1.0, 3.0, 6.0}            |
| diff(I)                     | {1.0, 1.0}                 |
| {1,2,3}^2                   | {1.0, 4.0, 9.0}            |
| theta(I-2)                  | {0.0, 1.0, 1.0}            |
| I < 3 && I >=1              | {1.0, 1.0, 0.0}            |
| I < 3 ? 12 : 13             | {12.0, 12.0, 13.0}         |
| {min(J), max(J), len(J)}    | {5.0, 10.0, 2.0}           |
| sort({5,1,3})               | {1.0, 3.0, 5.0}            |
|-----------------------------+----------------------------|


Note that since each ExpCalculator is a Function object itself, it can
be used as the input for other ExpCalculators.

Inspired by RPNcalculator by Joseph Heled (BEAST 1, BEAST 2 port by
Denise Kuehnert).  (This uses a parser generated by [[http://www.antlr.org][ANTLR]], which is
cheating.)


*** ExpCalculatorDistribution
:PROPERTIES:
:CUSTOM_ID: id-3-ExpCalculatorDistribution
:END:

This is basically identical to ExpCalculator, but extends the abstract
Distribution class, allowing the definition of arbitrary distributions
over R^n at runtime.  Distributions can be specified in terms of their
log or directly as probabilities (/probability densities).

The file ~ECdistribTest.xml~ in the examples/ folder is a simple
example where a multi-variate normal distribution is constructed.
This example also illustrates the nested expression concept mentioned
above.  The file ~ECdistribArraytest.xml~ in the same folder samples
the same posterior, but uses array notation to express the target
density.


*** ExpCalculatorParametricDistribution
:PROPERTIES:
:CUSTOM_ID: id-3-ExpCalculatorParametricDistribution
:END:

This provides a cut-down version of the ExpCalculatorDistribution
functionality that is compatible with beast.math.distributions.Prior.


* License
:PROPERTIES:
:CUSTOM_ID: id-1-License
:END:

The feast package is free (as in freedom).  With the exception of the
libraries on which it depends, it is made available under the terms of
the GNU General Public Licence version 3, which is distributed with feast
or may be found online at https://www.gnu.org/licenses/gpl-3.0.html.

# Evaluate the following block to update section IDs
#
#+begin_src emacs-lisp :cache no :exports none :results none
(org-map-entries
   (lambda ()
     (pcase (org-heading-components)
       (`(,level ,_ ,_ ,_ ,title ,_)
        (org-set-property "CUSTOM_ID"
                          (format "id-%d-%s" level (string-replace " " "-" title)))
        (format "%s %s" level title)))))
#+end_src

# Local Variables:
# org-html-validation-link: nil
# org-html-htmlize-output-type: css
# End:
