doc/index.html

<div id="outline-container-id-3-AlignmentFromNexus/Fasta" class="outline-4">
<h4 id="id-3-AlignmentFromNexus/Fasta"><span class="section-number-4">2.9.5.</span> AlignmentFromNexus/Fasta</h4>
<div class="outline-text-4" id="text-id-3-AlignmentFromNexus/Fasta">
<p>
This class allows alignments to be loaded at runtime from Nexus or Fasta files
rather than stored in the BEAST 2 XML:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Nexus:</span><span class="org-comment-delimiter"> --&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">alignment</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">'feast.fileio.AlignmentFromNexus'</span> <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"example.nexus"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>

<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Fasta:</span><span class="org-comment-delimiter"> --&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">alignment</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">'feast.fileio.AlignmentFromFasta'</span> <span class="org-nxml-attribute-local-name">fileName</span>=<span class="org-string">"example.fasta"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Sequence files can also be referenced using a URL:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Nexus:</span><span class="org-comment-delimiter"> --&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">alignment</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.AlignmentFromNexus"</span>
           <span class="org-nxml-attribute-local-name">url</span>=<span class="org-string">"https://example.com/alignment.nexus"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>

<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Fasta:</span><span class="org-comment-delimiter"> --&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">alignment</span> <span class="org-nxml-attribute-local-name">spec</span>=<span class="org-string">"feast.fileio.AlignmentFromFasta"</span>
           <span class="org-nxml-attribute-local-name">url</span>=<span class="org-string">"https://example.com/alignment.fasta"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
The Fasta import uses the sequence labels from the file as taxon labels.
</p>

<p>
Obviously these classes runs contrary to BEAST's philosophy of keeping
everything necessary to run an analysis in the XML file.  However, it
is sometimes convenient to be able to do this.  As a bonus, the
<code>xmlFileName</code> attribute can be used to write the appropriate XML
fragment to disk.
</p>
</div>
</div>
</div>

<div id="outline-container-id-2-Mathematical-Expressions" class="outline-3">
<h3 id="id-2-Mathematical-Expressions"><span class="section-number-3">2.10.</span> Mathematical Expressions</h3>
<div class="outline-text-3" id="text-id-2-Mathematical-Expressions">
<p>
The following classes, which are found in <code>feast.expressions</code>, provide
support for parsing of simple arithmetic expressions.
</p>
</div>


<div id="outline-container-id-3-ExpCalculator" class="outline-4">
<h4 id="id-3-ExpCalculator"><span class="section-number-4">2.10.1.</span> ExpCalculator</h4>
<div class="outline-text-4" id="text-id-3-ExpCalculator">
<p>
Takes an arithmetic expression and returns the result by acting
as a Loggable or a Function.  Binary operators can be applied to
Functions (including Parameters) of different lengths as in R, with
the result having the maximum of the two lengths, and the index into
the shortest parameter being the result index modulo the length of
that parameter. True and false are represented by 1.0 and 0.0 respectively.
</p>

<p>
Example expressions follow. (I and J are IDs of RealParameters with elements
{1.0, 2.0, 3.0} and {5.0, 10.0}, respectively.)
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Loggable/Function value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2.5*I</td>
<td class="org-left">{2.5, 5.0, 7.5}</td>
</tr>

<tr>
<td class="org-left">I+J</td>
<td class="org-left">{6.0, 12.0, 8.0}</td>
</tr>

<tr>
<td class="org-left">exp(I[0])</td>
<td class="org-left">{2.718&#x2026;}</td>
</tr>

<tr>
<td class="org-left">{I,J}</td>
<td class="org-left">{1.0, 2.0, 3.0, 5.0, 10.0}</td>
</tr>

<tr>
<td class="org-left">1:3</td>
<td class="org-left">{1.0, 2.0, 3.0}</td>
</tr>

<tr>
<td class="org-left">J[1:0]</td>
<td class="org-left">{10.0, 5.0}</td>
</tr>

<tr>
<td class="org-left">1[1:3]</td>
<td class="org-left">{1.0, 1.0, 1.0}</td>
</tr>

<tr>
<td class="org-left">-log(exp(J))/(1.5+0.5*I[0])</td>
<td class="org-left">{-2.5, -5.0}</td>
</tr>

<tr>
<td class="org-left">sqrt(J)</td>
<td class="org-left">{2.236&#x2026;, 3.162&#x2026;}</td>
</tr>

<tr>
<td class="org-left">J!</td>
<td class="org-left">{1.0, 2.0, 6.0}</td>
</tr>

<tr>
<td class="org-left">2<sup>I</sup></td>
<td class="org-left">{2.0, 4.0, 6.0}</td>
</tr>

<tr>
<td class="org-left">sum(I)</td>
<td class="org-left">{6.0}</td>
</tr>

<tr>
<td class="org-left">cumsum(I)</td>
<td class="org-left">{1.0, 3.0, 6.0}</td>
</tr>

<tr>
<td class="org-left">diff(I)</td>
<td class="org-left">{1.0, 1.0}</td>
</tr>

<tr>
<td class="org-left">{1,2,3}<sup>2</sup></td>
<td class="org-left">{1.0, 4.0, 9.0}</td>
</tr>

<tr>
<td class="org-left">theta(I-2)</td>
<td class="org-left">{0.0, 1.0, 1.0}</td>
</tr>

<tr>
<td class="org-left">I &lt; 3 &amp;&amp; I &gt;=1</td>
<td class="org-left">{1.0, 1.0, 0.0}</td>
</tr>

<tr>
<td class="org-left">I &lt; 3 ? 12 : 13</td>
<td class="org-left">{12.0, 12.0, 13.0}</td>
</tr>

<tr>
<td class="org-left">{min(J), max(J), len(J)}</td>
<td class="org-left">{5.0, 10.0, 2.0}</td>
</tr>

<tr>
<td class="org-left">sort({5,1,3})</td>
<td class="org-left">{1.0, 3.0, 5.0}</td>
</tr>
</tbody>
</table>


<p>
Note that since each ExpCalculator is a Function object itself, it can
be used as the input for other ExpCalculators.
</p>

<p>
Inspired by RPNcalculator by Joseph Heled (BEAST 1, BEAST 2 port by
Denise Kuehnert).  (This uses a parser generated by <a href="http://www.antlr.org">ANTLR</a>, which is
cheating.)
</p>
</div>
</div>


<div id="outline-container-id-3-ExpCalculatorDistribution" class="outline-4">
<h4 id="id-3-ExpCalculatorDistribution"><span class="section-number-4">2.10.2.</span> ExpCalculatorDistribution</h4>
<div class="outline-text-4" id="text-id-3-ExpCalculatorDistribution">
<p>
This is basically identical to ExpCalculator, but extends the abstract
Distribution class, allowing the definition of arbitrary distributions
over R<sup>n</sup> at runtime.  Distributions can be specified in terms of their
log or directly as probabilities (/probability densities).
</p>

<p>
The file <code>ECdistribTest.xml</code> in the examples/ folder is a simple
example where a multi-variate normal distribution is constructed.
This example also illustrates the nested expression concept mentioned
above.  The file <code>ECdistribArraytest.xml</code> in the same folder samples
the same posterior, but uses array notation to express the target
density.
</p>
</div>
</div>


<div id="outline-container-id-3-ExpCalculatorParametricDistribution" class="outline-4">
<h4 id="id-3-ExpCalculatorParametricDistribution"><span class="section-number-4">2.10.3.</span> ExpCalculatorParametricDistribution</h4>
<div class="outline-text-4" id="text-id-3-ExpCalculatorParametricDistribution">
<p>
This provides a cut-down version of the ExpCalculatorDistribution
functionality that is compatible with beast.math.distributions.Prior.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-id-1-License" class="outline-2">
<h2 id="id-1-License"><span class="section-number-2">3.</span> License</h2>
<div class="outline-text-2" id="text-id-1-License">
<p>
This software is free (as in freedom).  With the exception of the
libraries on which it depends, it is made available under the terms of
the GNU General Public Licence version 3, which is contained in this
directory in the file named COPYING.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tim Vaughan</p>
<p class="date">Created: 2023-04-17 Mon 08:48</p>
</div>
</body>
</html>
